app/Models/HomeModel.php

SELECT `transaction_id`, `source`, `descriptions`, `transaction_date`
FROM `transactions`
GROUP BY `transaction_id`
SELECT `a`.`account_name`, `t`.`debit`, `t`.`credit`
FROM `transactions` `t`
JOIN `accounts` `a` ON `a`.`account_id` = `t`.`account_id`
WHERE `t`.`transaction_id` = '1'
---
public function getAllTransactions()
{
    // Step 1: Get all distinct transaction headers (grouped by transaction_id)
    $builder = $this->db->table('transactions');
    $builder->select('transaction_id, source, descriptions, transaction_date');
    $builder->groupBy('transaction_id');
    $headers = $builder->get()->getResultArray();

    $final = [];

    foreach ($headers as $header) {
        $transaction_id = $header['transaction_id'];

        // Step 2: Get all entries for this transaction_id (debit and credit rows)
        $entriesBuilder = $this->db->table('transactions t');
        $entriesBuilder->select('a.account_name, t.debit, t.credit');
        $entriesBuilder->join('accounts a', 'a.account_id = t.account_id');
        $entriesBuilder->where('t.transaction_id', $transaction_id);
        $entries = $entriesBuilder->get()->getResultArray();